EX07: PROC OPTIONS (MAIN);                                                     
    DCL A BIT (3) INIT ( 10B );                                                
    DCL B BIT (3) INIT ( 101B );                                               
    DCL C BIT (16);                                                            
    C = SUBSTR((B !! A),2,3);                                                  
END EX07;                                                                      
